src/main/resources/xml/accommodationSalesServicePort/buyPoints/buyPoints.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:buyPoints>
         <request>
            <!--Optional:-->
            <travelPlanGuest>
               <!--Optional:-->
               <suffix>?</suffix>
               <!--Optional:-->
               <title>?</title>
               <!--Optional:-->
               <firstName>?</firstName>
               <!--Optional:-->
               <lastName>?</lastName>
               <!--Optional:-->
               <middleName>?</middleName>
               <partyId>?</partyId>
               <!--Zero or more repetitions:-->
               <phoneDetails>
                  <locatorId>?</locatorId>
                  <guestLocatorId>?</guestLocatorId>
                  <!--Optional:-->
                  <locatorUseType>?</locatorUseType>
                  <primary>?</primary>
                  <!--Optional:-->
                  <deviceType>?</deviceType>
                  <extension>?</extension>
                  <!--Optional:-->
                  <number>?</number>
               </phoneDetails>
               <!--Zero or more repetitions:-->
               <addressDetails>
                  <locatorId>?</locatorId>
                  <guestLocatorId>?</guestLocatorId>
                  <!--Optional:-->
                  <locatorUseType>?</locatorUseType>
                  <primary>?</primary>
                  <!--Optional:-->
                  <addressLine1>?</addressLine1>
                  <!--Optional:-->
                  <addressLine2>?</addressLine2>
                  <!--Optional:-->
                  <city>?</city>
                  <!--Optional:-->
                  <country>?</country>
                  <!--Optional:-->
                  <postalCode>?</postalCode>
                  <!--Optional:-->
                  <state>?</state>
                  <!--Optional:-->
                  <regionName>?</regionName>
               </addressDetails>
               <!--Zero or more repetitions:-->
               <emailDetails>
                  <locatorId>?</locatorId>
                  <guestLocatorId>?</guestLocatorId>
                  <!--Optional:-->
                  <locatorUseType>?</locatorUseType>
                  <primary>?</primary>
                  <!--Optional:-->
                  <address>?</address>
               </emailDetails>
               <!--Optional:-->
               <membershipDetail>
                  <!--Optional:-->
                  <expirationDate>?</expirationDate>
                  <!--Optional:-->
                  <memberShipType>?</memberShipType>
                  <!--Optional:-->
                  <membershipId>?</membershipId>
                  <policyId>?</policyId>
                  <productChannelId>?</productChannelId>
                  <!--Optional:-->
                  <guestMembershipId>?</guestMembershipId>
               </membershipDetail>
               <doNotMailIndicator>?</doNotMailIndicator>
               <doNotPhoneIndicator>?</doNotPhoneIndicator>
               <!--Optional:-->
               <preferredLanguage>?</preferredLanguage>
               <dclGuestId>?</dclGuestId>
               <!--Optional:-->
               <dclTransferCode>?</dclTransferCode>
               <guestId>?</guestId>
               <!--Optional:-->
               <guestTypeName>?</guestTypeName>
               <!--Optional:-->
               <favouriteCharacter>?</favouriteCharacter>
               <active>?</active>
               <!--Zero or more repetitions:-->
               <guestIdReferences>
                  <type>?</type>
                  <value>?</value>
               </guestIdReferences>
               <!--Optional:-->
               <gender>?</gender>
               <!--Optional:-->
               <dob>?</dob>
            </travelPlanGuest>
            <facilityId>?</facilityId>
            <locationId>?</locationId>
            <sourceAccountingCenter>?</sourceAccountingCenter>
            <!--Optional:-->
            <salesChannel>?</salesChannel>
            <!--Optional:-->
            <communicationChannel>?</communicationChannel>
            <!--Optional:-->
            <otupInfo>
               <!--Optional:-->
               <productId>?</productId>
               <count>?</count>
            </otupInfo>
            <!--Optional:-->
            <enttlInfo>
               <!--Optional:-->
               <useMonth>?</useMonth>
               <!--Optional:-->
               <useYear>?</useYear>
               <!--Optional:-->
               <count>?</count>
               <!--Optional:-->
               <resortCode>?</resortCode>
               <!--Zero or more repetitions:-->
               <externalReference>
                  <!--Optional:-->
                  <externalReferenceType>?</externalReferenceType>
                  <!--Optional:-->
                  <externalReferenceCode>?</externalReferenceCode>
                  <!--Optional:-->
                  <externalReferenceNumber>?</externalReferenceNumber>
                  <!--Optional:-->
                  <externalReferenceSource>?</externalReferenceSource>
               </externalReference>
            </enttlInfo>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:buyPoints>
   </soapenv:Body>
</soapenv:Envelope>